src/InformationRegisters/НастройкиОбменаСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаСУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучатьКодовЗаИтерацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоКодовВЗаказе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъектАдрес</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъектАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияУправленияЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииУправленияЗаказамиИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиОбменаСУЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	УправлениеДоступомИСПереопределяемый.ПриЗаполненииОграниченияДоступа(
		Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Ограничение);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПроизводственныйОбъектПолучитьСписокВыбора(Организация, ПроизводственныйОбъект = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	ТекстЗапросаСписок =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъект КАК ПроизводственныйОбъект,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиОбменаСУЗ.ПроизводственныйОбъект) КАК Представление,
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдресСтрокой КАК АдресОбъекта
	|ИЗ
	|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
	|ГДЕ
	|	НастройкиОбменаСУЗ.Организация = &Организация
	|	И (НЕ НастройкиОбменаСУЗ.ПроизводственныйОбъект.Ссылка ЕСТЬ NULL
	|	ИЛИ ТИПЗНАЧЕНИЯ(НастройкиОбменаСУЗ.ПроизводственныйОбъект) = ТИП(Строка)
	|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект <> """");";
	
	Если ПроизводственныйОбъект = Неопределено Тогда
		ТекстЗапросаОбъект = "";
	Иначе
		ТекстЗапросаОбъект =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
		|ГДЕ
		|	НастройкиОбменаСУЗ.Организация = &Организация
		|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект = &ПроизводственныйОбъект";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("ПроизводственныйОбъект", ПроизводственныйОбъект);
	Запрос.Текст = ТекстЗапросаСписок + ТекстЗапросаОбъект;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	
	// Список выбора формируем, если всего имеется не более 10 записей
	Если Выборка.Количество() < 11 Тогда
		Пока Выборка.Следующий() Цикл
			Представление = Выборка.Представление;
			Если ЗначениеЗаполнено(Выборка.АдресОбъекта) Тогда
				Представление = Представление + " (" + Выборка.АдресОбъекта + ")";
			КонецЕсли;
			СписокВыбора.Добавить(Выборка.ПроизводственныйОбъект, Представление);
		КонецЦикла;
	КонецЕсли;
	
	Если ПроизводственныйОбъект <> Неопределено Тогда
		Если РезультатЗапроса[1].Пустой() Тогда
			ПроизводственныйОбъект = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ПолучитьАдресПроизводственногоОбъекта(Организация, ПроизводственныйОбъект) Экспорт
	
	ДанныеАдреса = Новый Структура("ПроизводственныйОбъектАдрес, ПроизводственныйОбъектАдресСтрокой");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("ПроизводственныйОбъект", ПроизводственныйОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдрес КАК ПроизводственныйОбъектАдрес,
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдресСтрокой КАК ПроизводственныйОбъектАдресСтрокой
	|ИЗ
	|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
	|ГДЕ
	|	НастройкиОбменаСУЗ.Организация = &Организация
	|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект = &ПроизводственныйОбъект";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеАдреса, Выборка);
	КонецЕсли;
	
	Возврат ДанныеАдреса;
	
КонецФункции

Функция ДоступныеНастройкиОбменаСУЗ(Организации = Неопределено, ТолькоЗаполненные = Истина) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	НастройкиОбменаСУЗ.Организация,
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъект
	|ИЗ
	|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ";
	
	Если Организации <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	НастройкиОбменаСУЗ.Организация В (&Организации)";
		Запрос.УстановитьПараметр("Организации", Организации);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ДоступныеНастройки = Запрос.Выполнить().Выгрузить();
	
	Если ТолькоЗаполненные Тогда
		КоличествоСтрок = ДоступныеНастройки.Количество();
		Для Счетчик = 1 По КоличествоСтрок Цикл
			Строка = ДоступныеНастройки[КоличествоСтрок - Счетчик];
			Если Не ЗначениеЗаполнено(Строка.Организация)
				Или Не ЗначениеЗаполнено(Строка.ПроизводственныйОбъект) Тогда
				ДоступныеНастройки.Удалить(Строка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДоступныеНастройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
